# PANDAS HANDBOOK

In [1]:
import numpy as np
import pandas as pd

# SERIES

## How to create a serie

In [19]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

simpleList = pd.Series(index = labels, data = my_list)
simpleNPARRAY = pd.Series(index= labels, data = arr)
simpleDict = pd.Series(d)

print(simpleList, "\n")
print(simpleNPARRAY,"\n")
print(simpleDict,"\n")

a    10
b    20
c    30
dtype: int64

a    10
b    20
c    30
dtype: int32

a    10
b    20
c    30
dtype: int64

## Selecting an index

In [27]:
index = np.arange(1,6)
countries = np.array(["USA", "GER", "CHI", "ITA", "CRC"])

serieCountries = pd.Series( data = countries, index = index)
#print(serieCountries)

indexNumber = int(input("Please select one number between 1 and 5"))
print(f"The number {indexNumber} has the value of: {serieCountries[indexNumber]} ")

Please select one number between 1 and 53
The number 3 has the value of: CHI

## Selecting an index 2

In [43]:
print(f"I can be done by simple slicing \n {serieCountries[2:4]} \n")
print(f"I can be done by pandas iloc \n {serieCountries.iloc[3]}\n")
print(f"I can be done by X top number \n {serieCountries.head(3)}\n")
print(f"I can be done by X bottom number \n {serieCountries.tail(2)}\n")
 
justAmericaContries = (serieCountries == "USA" )| (serieCountries == "CRC")
print(serieCountries[justAmericaContries])

I can be done by simple slicing
 3    CHI
4    ITA
dtype: object

I can be done by pandas iloc
 ITA

I can be done by X top number
 1    USA
2    GER
3    CHI
dtype: object

I can be done by X bottom number
 4    ITA
5    CRC
dtype: object

1    USA
5    CRC
dtype: object

## More info about Series

In [28]:

print(serieCountries.index)


print(serieCountries.values)


print(serieCountries.dtype)


print(serieCountries.size)

print(serieCountries.shape)

Int64Index([1, 2, 3, 4, 5], dtype='int64')
['USA' 'GER' 'CHI' 'ITA' 'CRC']
object
5
(5,)

## Ordering values

In [48]:
labels = np.array(["RED", "BLUE", "GREEN"])
values = np.array([34,43,45])
dataset = pd.Series(data=values, index= labels)
print(dataset)

orderlist = dataset.sort_values()
print(f"This is the ordered list: \n {orderlist}")

orderlist = dataset.sort_values(ascending=False)
print(f"This is the ordered list: \n {orderlist}")

RED      34
BLUE     43
GREEN    45
dtype: int32
This is the ordered list:
 RED      34
BLUE     43
GREEN    45
dtype: int32
This is the ordered list:
 GREEN    45
BLUE     43
RED      34
dtype: int32

## Math

In [59]:
mathList = pd.Series([1,3,5,7])

print(mathList*4)
print(mathList+4)
print(mathList-4)
print(mathList/4)

0     4
1    12
2    20
3    28
dtype: int64
0     5
1     7
2     9
3    11
dtype: int64
0   -3
1   -1
2    1
3    3
dtype: int64
0    0.25
1    0.75
2    1.25
3    1.75
dtype: float64

## Counting values

In [53]:
repetitiveList = pd.Series([True,False, True, True, False, False, False, True, False])

countingBollList = repetitiveList.value_counts()

print(countingBollList)
print(countingBollList.nunique())

False    5
True     4
dtype: int64
2

## Unique values

In [56]:
print(countingBollList.unique())
print(countingBollList.nunique())
print(countingBollList.count())

[5 4]
2
2

## Converting into

In [ ]:
dataset.to_list()
dataset.to_dict() 
dataset.to_csv() 
dataset.to_json() 
dataset.name = 'new Name'
dataset.to_frame()

# DATAFRAMES

In [ ]:
##Create a DataFrame

In [5]:
dic = {"RED": [4,5,6,7], "BLUE": [6,3,5,7]}
pdDic = pd.DataFrame(dic, index = ("Monday", "Tuesday", "Wednesday", "Thursday"))
print(pdDic)

           RED  BLUE
Monday       4     6
Tuesday      5     3
Wednesday    6     5
Thursday     7     7

## Create a new column

In [6]:
pdDic["GREEN"] = (5,8,2,3)
print(pdDic)

           RED  BLUE  GREEN
Monday       4     6      5
Tuesday      5     3      8
Wednesday    6     5      2
Thursday     7     7      3

## Drop a column

In [30]:
backupPdDic = pdDic.copy()
backupPdDic.drop("BLUE", axis = 1, inplace = True)
print(backupPdDic)

           RED  GREEN
Monday       4      5
Tuesday      5      8
Wednesday    6      2
Thursday     7      3

## Edit Info

In [87]:
backupPdDic= pdDic.copy()
backupPdDic.loc["Tuesday","RED"] = 50
print(backupPdDic)

backupPdDic.rename(columns={"RED": "PINK", "BLUE": "LIGHTBLUE"}, inplace = True)
print(backupPdDic)

           RED  BLUE  GREEN
Monday       4     6      5
Tuesday     50     3      8
Wednesday    6     5      2
Thursday     7     7      3
           PINK  LIGHTBLUE  GREEN
Monday        4          6      5
Tuesday      50          3      8
Wednesday     6          5      2
Thursday      7          7      3

In [ ]:
backupPdDic["PINK"].str.lower()
backupPdDic["PINK"].str.replace(" ", "")

## You can get more info from the DataFrames

In [31]:
print(pdDic.info(), "\n")
print(pdDic.size, "\n")
print(pdDic.shape, "\n")
print(pdDic.describe(), "\n")
print(pdDic.ndim, "\n")
print(pdDic.index, "\n")
print(pdDic.columns, "\n")

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Monday to Thursday
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RED     4 non-null      int64
 1   BLUE    4 non-null      int64
 2   GREEN   4 non-null      int64
dtypes: int64(3)
memory usage: 300.0+ bytes
None

12

(4, 3)

            RED      BLUE     GREEN
count  4.000000  4.000000  4.000000
mean   5.500000  5.250000  4.500000
std    1.290994  1.707825  2.645751
min    4.000000  3.000000  2.000000
25%    4.750000  4.500000  2.750000
50%    5.500000  5.500000  4.000000
75%    6.250000  6.250000  5.750000
max    7.000000  7.000000  8.000000

2

Index(['Monday', 'Tuesday', 'Wednesday', 'Thursday'], dtype='object')

Index(['RED', 'BLUE', 'GREEN'], dtype='object')

# Slicing by loc and iloc

In [14]:
print(pdDic.loc["Monday"], "\n")
print(pdDic.iloc[3])

RED      4
BLUE     6
GREEN    5
Name: Monday, dtype: int64

RED      7
BLUE     7
GREEN    3
Name: Thursday, dtype: int64

In [22]:
print(pdDic.iloc[2:4], "\n")
print(pdDic.iloc[::2], "\n")
print(pdDic.loc[["Monday", "Thursday"]], "\n")

           RED  BLUE  GREEN
Wednesday    6     5      2
Thursday     7     7      3

           RED  BLUE  GREEN
Monday       4     6      5
Wednesday    6     5      2

          RED  BLUE  GREEN
Monday      4     6      5
Thursday    7     7      3

## Conditionals

In [39]:
redMoreThanFive = pdDic["RED"] > 5
print(pdDic.RED[redMoreThanFive], "\n")

between3And5 =  (pdDic > 3)  & (pdDic<7)
print(pdDic[between3And5], "\n")

haveWhere3Or5 = pdDic.isin([3,5])
print(pdDic[haveWhere3Or5], "\n")

Wednesday    6
Thursday     7
Name: RED, dtype: int64

           RED  BLUE  GREEN
Monday     4.0   6.0    5.0
Tuesday    5.0   NaN    NaN
Wednesday  6.0   5.0    NaN
Thursday   NaN   NaN    NaN

           RED  BLUE  GREEN
Monday     NaN   NaN    5.0
Tuesday    5.0   3.0    NaN
Wednesday  NaN   5.0    NaN
Thursday   NaN   NaN    3.0

## Other Methods

In [63]:
print(pdDic.loc["Thursday"].unique())

print(pdDic["RED"].mean())

[7 3]
5.5

## Reording

In [64]:
pdReordered = pdDic[["GREEN", "RED", "BLUE"]]
print(pdReordered)

           GREEN  RED  BLUE
Monday         5    4     6
Tuesday        8    5     3
Wednesday      2    6     5
Thursday       3    7     7

## MultiIndex

In [106]:
mainColors = np.array(["RED", "RED", "BLUE", "BLUE"])
secondaryColors = np.array(["PINK", "DARKRED", "LIGHTBLUE", "DARKBLUE"])
multiIndex = list(zip(mainColors,secondaryColors))
multiIndex = pd.MultiIndex.from_tuples(multiIndex)
data = np.random.randn(4,2)
cols = ["A", "B"]

df = pd.DataFrame(data, index = multiIndex, columns= cols)

print(df)

                       A         B
RED  PINK       0.263053 -0.296744
     DARKRED    1.964273  0.880675
BLUE LIGHTBLUE -0.728961  0.171798
     DARKBLUE   0.849123  1.331422

In [107]:
df.loc["RED"]

                A         B
PINK     0.263053 -0.296744
DARKRED  1.964273  0.880675

In [108]:
df.loc["BLUE"].loc["DARKBLUE"]

A    0.849123
B    1.331422
Name: DARKBLUE, dtype: float64

In [112]:
df.index.names = (["MAIN", "SECONDARY"])
df

                       A         B
MAIN SECONDARY
RED  PINK       0.263053 -0.296744
     DARKRED    1.964273  0.880675
BLUE LIGHTBLUE -0.728961  0.171798
     DARKBLUE   0.849123  1.331422

# MISSING VALUES

In [2]:
dfWithNAN = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
dfWithNAN

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
dfWithNAN.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [3]:
dfWithNAN.dropna(axis=1)

   C
0  1
1  2
2  3

In [4]:
dfWithNAN.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
dfWithNAN.dropna(axis = 0, thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [6]:
dfWithNAN.fillna(value=4)

     A    B  C
0  1.0  5.0  1
1  2.0  4.0  2
2  4.0  4.0  3

In [7]:
dfWithNAN.fillna(value = dfWithNAN["C"].median())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

# GROUP BY, MERGE, CONCAT, JOIN

## Group By

In [8]:
tools = pd.read_excel("tools.xlsx", sheet_name="A")
tools

        Product  Quantity
0        Hammer         5
1        Shovel         2
2           Saw         3
3           Axe         6
4        Shovel         4
5           Axe         8
6   Screwdriver         9
7   Screwdriver         6
8           Saw         3
9        Hammer         4
10          Axe         5
11       Shovel         5
12          Axe         4
13       Shovel         5
14       Hammer         6
15  Screwdriver         1
16          Axe         5
17       Shovel         7
18          Axe         6

In [10]:
gpTOOLS = tools.groupby("Product")["Quantity"].sum()
gpTOOLS = pd.DataFrame(gpTOOLS)
gpTOOLS

             Quantity
Product
Axe                34
Hammer             15
Saw                 6
Screwdriver        16
Shovel             23

In [11]:
gpTOOLS.describe().transpose()

          count  mean        std  min   25%   50%   75%   max
Quantity    5.0  18.8  10.425929  6.0  15.0  16.0  23.0  34.0

In [31]:
tools.sort_values(by = "Quantity", ascending = False)

        Product  Quantity
6   Screwdriver         9
5           Axe         8
17       Shovel         7
18          Axe         6
3           Axe         6
7   Screwdriver         6
14       Hammer         6
11       Shovel         5
16          Axe         5
13       Shovel         5
0        Hammer         5
10          Axe         5
12          Axe         4
4        Shovel         4
9        Hammer         4
8           Saw         3
2           Saw         3
1        Shovel         2
15  Screwdriver         1

## Concat

In [12]:
jan = {"name":["Sam", "Raul", "Luke"],
      "age": [18,56,26]}


print(jan)

feb = {"name":["Luis", "Lautaro", "Sofia"],
      "age": [30,20,44]}


print(feb)

mar = {"name":["Homero", "Seiya", "Ruth"],
      "age": [34,19,45]}

print(mar)

{'name': ['Sam', 'Raul', 'Luke'], 'age': [18, 56, 26]}
{'name': ['Luis', 'Lautaro', 'Sofia'], 'age': [30, 20, 44]}
{'name': ['Homero', 'Seiya', 'Ruth'], 'age': [34, 19, 45]}

In [13]:
pdjan = pd.DataFrame(jan)
pdfeb = pd.DataFrame(feb)
pdmar = pd.DataFrame(mar)

In [14]:
firstThreeMonths = pd.concat([pdjan, pdfeb, pdmar])
firstThreeMonths.reset_index()

   index     name  age
0      0      Sam   18
1      1     Raul   56
2      2     Luke   26
3      0     Luis   30
4      1  Lautaro   20
5      2    Sofia   44
6      0   Homero   34
7      1    Seiya   19
8      2     Ruth   45

## Merge

In [15]:
emplodata = pd.read_excel("tools.xlsx", sheet_name = "B")
emplodata.set_index(emplodata["ID"])

    ID     Name  Age
ID
1    1   Julian   85
2    2   Rebeca   42
3    3  Natalia   58
4    4      Leo   65
5    5     Luis   15

In [16]:
emplodata2 = pd.read_excel("tools.xlsx", sheet_name = "C")
emplodata2.set_index("ID")

    Province      Phone
ID
3   Alajuela  1111-1111
4    Cartago  5555-5555
1    Heredia  1234-1234
5   San Jose  9999-6666
2      Limon  7894-7894

In [17]:
emplodataTogether = pd.merge(emplodata, emplodata2, how = "inner", on = "ID")
emplodataTogether.set_index("ID")

       Name  Age  Province      Phone
ID
1    Julian   85   Heredia  1234-1234
2    Rebeca   42     Limon  7894-7894
3   Natalia   58  Alajuela  1111-1111
4       Leo   65   Cartago  5555-5555
5      Luis   15  San Jose  9999-6666

## Join

In [18]:
emplodata.set_index("ID").join(emplodata2.set_index("ID"))

       Name  Age  Province      Phone
ID
1    Julian   85   Heredia  1234-1234
2    Rebeca   42     Limon  7894-7894
3   Natalia   58  Alajuela  1111-1111
4       Leo   65   Cartago  5555-5555
5      Luis   15  San Jose  9999-6666

In [34]:
def YearsIntoMonths(x):
    return x * 12

In [35]:
emplodata["Age"].apply(YearsIntoMonths)

0    1020
1     504
2     696
3     780
4     180
Name: Age, dtype: int64

## Pivot Table

In [22]:
carData = pd.read_excel("tools.xlsx", sheet_name = "D")
carData.head()

     ID  Color  Month
0  AAA1    Red  April
1  AAA2  Black  March
2  AAA3  White    May
3  AAA4   Blue  April
4  AAA5  White    May

In [29]:
carData.pivot_table(values = "ID", index= "Color", columns = "Month", aggfunc = np.count_nonzero)

Month  April  March  May
Color
Black    NaN    2.0  2.0
Blue     2.0    2.0  1.0
Red      2.0    2.0  NaN
White    4.0    NaN  3.0

In [39]:
carData.to_csv("CarDataPivot", index = True)

In [41]:
carData.to_excel("CarDataPivot.xlsx", sheet_name = "FIRST SHEET")